Revit 2026 API

# ControlledApplicationCurrentUsersDataFolderPath Property

---

Path to data folder for the current user.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string CurrentUsersDataFolderPath { get; }
```
```vb
Public ReadOnly Property CurrentUsersDataFolderPath As String
	Get
```
```cpp
public:
property String^ CurrentUsersDataFolderPath {
	String^ get ();
}
```
```fsharp
member CurrentUsersDataFolderPath : string with get
```

#### Property Value

String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace